"""
Модуль для обробки та аналізу даних за допомогою бібліотеки pandas.

Клас `DataHandler` надає методи для роботи з даними у форматі CSV, зокрема:
- Отримання мінімальних та максимальних значень для кожного стовпця.
- Фільтрація даних за заданими умовами.

Методи:
- `get_column_extremes(self)`: Повертає мінімальні та максимальні значення для кожного стовпця даних.
- `filter_data(self, condition)`: Фільтрує дані за заданою умовою.
"""

import pandas as pd

class DataHandler:
    """
    Клас для обробки даних у форматі CSV з використанням бібліотеки pandas.

    Атрибути:
    - `data`: Дані, що зберігаються у вигляді DataFrame.

    Методи:
    - `get_column_extremes(self)`: Повертає мінімальні та максимальні значення для кожного стовпця.
    - `filter_data(self, condition)`: Фільтрує дані за заданою умовою.
    """

    def __init__(self, filepath):
        """
        Ініціалізує клас DataHandler, зчитуючи дані з CSV файлу.

        Параметри:
        - `filepath`: Шлях до файлу CSV, що містить дані.
        """
        self.data = pd.read_csv(filepath)

    def get_column_extremes(self):
        """
        Повертає мінімальні та максимальні значення для кожного стовпця даних.

        Повертає:
        - `pandas.DataFrame`: Містить мінімальні та максимальні значення для кожного стовпця.
        """
        return self.data.describe().loc[['min', 'max']]

    def filter_data(self, condition):
        """
        Фільтрує дані за заданою умовою.

        Параметри:
        - `condition`: Умова для фільтрації даних у вигляді рядка (наприклад, 'age > 30').

        Повертає:
        - `pandas.DataFrame`: Фільтровані дані, що задовольняють умову.
        """
        return self.data.query(condition)
