"""
Модуль для візуалізації даних з можливістю експорту графіків у файл.

Класи:
- `BaseVisualization`: Абстрактний клас для створення візуалізацій. Містить методи для побудови графіків та експорту їх у файли.

Методи:
- `plot(self, *args, **kwargs)`: Абстрактний метод, який має бути реалізований у підкласах для побудови графіків.
- `export_chart(self, filename, format='png')`: Експортує побудований графік у файл за заданим іменем та форматом у директорію 'lab8'.
"""

import os
import matplotlib.pyplot as plt
from abc import ABC, abstractmethod

class BaseVisualization(ABC):
    """
    Абстрактний клас для візуалізації даних.
    
    Атрибути:
    - `data`: Дані, які будуть використовуватись для побудови графіку.
    
    Методи:
    - `plot(self, *args, **kwargs)`: Абстрактний метод для побудови графіку.
    - `export_chart(self, filename, format='png')`: Метод для експорту графіку у файл.
    """
    
    def __init__(self, data):
        """
        Ініціалізує об'єкт візуалізації з даними.
        
        Параметри:
        - `data`: Дані для побудови графіку.
        """
        self.data = data

    @abstractmethod
    def plot(self, *args, **kwargs):
        """
        Абстрактний метод для побудови графіку. Повинен бути реалізований у підкласах.
        
        Параметри:
        - `*args`, `**kwargs`: Додаткові параметри для побудови графіку.
        """
        pass

    def export_chart(self, filename, format='png'):
        """
        Експортує побудований графік у файл.
        
        Зберігає графік у файл в директорії 'lab8' з заданим ім'ям та форматом.

        Параметри:
        - `filename`: Ім'я файлу для збереження графіку.
        - `format`: Формат збереження файлу (за замовчуванням 'png').
        
        Повертає:
        - Нічого не повертає, але виводить шлях до збереженого файлу.
        """
        # Створюємо шлях до директорії lab8 і зберігаємо графік
        save_dir = 'd:/lpnu-specialized-programming-languages-2024/lab8'
        save_path = os.path.join(save_dir, f"{filename}.{format}")
        
        plt.savefig(save_path)
        print(f"Графік експортовано як {save_path}")
