class ColorConfig:
    """
    Клас для управління кольоровими конфігураціями в консолі, що використовує ANSI-коди для кольорів.

    Атрибути:
    COLORS (dict): Словник, що містить відповідність між назвами кольорів та їх ANSI-кодами.
    """

    COLORS = {
        "Red": "\033[31m",      # Червоний
        "Green": "\033[32m",    # Зелений
        "Blue": "\033[34m",     # Синій
        "Yellow": "\033[33m",   # Жовтий
        "Cyan": "\033[36m",     # Блакитний
        "Magenta": "\033[35m",  # Фіолетовий
        "White": "\033[37m",    # Білий
        "Black": "\033[30m",    # Чорний
        "Gray": "\033[90m",     # Сірий
        "Orange": "\033[38;5;214m",  # Оранжевий
        "Reset": "\033[0m"      # Скидання кольору
    }

    @staticmethod
    def get_color_code(color_name):
        """
        Отримує ANSI-код для заданого кольору.

        Параметри:
        color_name (str): Назва кольору (наприклад, "Red", "Blue", "Green").

        Повертає:
        str: ANSI-код для зазначеного кольору. Якщо колір не знайдений, повертається код для білого кольору.
        """
        return ColorConfig.COLORS.get(color_name, ColorConfig.COLORS["White"])
